Revit 2027 API
RebarConstraint.GetDistanceToTargetHostFace Method
 Returns the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetDistanceToTargetHostFace()
Public Function GetDistanceToTargetHostFace As Double
public:
double GetDistanceToTargetHostFace()
member GetDistanceToTargetHostFace : unit -> float
Return Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace'.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace